Revit 2024 API
BuiltInFailures.ConstraintFailures Class
 Failures about Constraint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ConstraintFailures
Visual Basic
Public NotInheritable Class ConstraintFailures
Visual C++
public ref class ConstraintFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures
See Also
BuiltInFailures.ConstraintFailures Members
Autodesk.Revit.DB Namespace